# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 3  # number of classes
depth_multiple: 0.33  # model depth multiple #模型深度倍数，模型的层数越多，对应的深度越深。创建模型的时候number*th_multiple eg.3*0.33近似为1（bottleneckCSP数）
width_multiple: 0.50  # layer channel multiple #模型的通道倍数，以第0层为例，在创建卷积层的时候，给了它一个参数64，这一层输出的通道数，64*0.5=32个输出通道数
                      #在网络结构中，一个层输出的通道数越多，表示这一层越宽，即宽度倍数。
 #层数越多，宽度越宽，所对应的参数量越大，模型就越复杂，一般来说准确率越高。n/s/m/l/x
anchors: #先验框。目标检测中的含义：提前预定义好的矩形框，利用矩形框来实现最终的检测。有了anchors，在训练模型的时候会刻意把这些层往小中大目标上去引导
  - [10,13, 16,30, 33,23]  # P3/8 #对应不同的特征层级，低层 每一层定义了3个不同的anchors大小。anchors[0]
  - [30,61, 62,45, 59,119]  # P4/16 #中层 anchors[1]
  - [116,90, 156,198, 373,326]  # P5/32 #高层 anchors[2]
#activation: nn.ReLU()
# YOLOv5 v6.0 backbone #yolov5s.yaml指导搭建模型的配置文件
backbone:
  # [from, number, module, args]#以第0层为例
  #from：表示第0层的输入是从哪一层过来的，-1表示从上一层过来的
  #number：第0层的模块有几个，和深度倍数有关（depth_multiple*number）
  #model：表示这一层的模块结构，这些不同的层结构都定义在 model\\common.py 文件中
  #args：参数，创建每一层的模块的时候，所需要传入的参数信息
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2  #每一层的层结构信息，共24层 P1:金字塔第一层。2：卷积层步长为2，640*640---320*320,缩小了一倍
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4 #（pyramid）p2:金字塔第二层 步长为2的卷积 1/4
   [-1, 3, C3, [128]], # 2

   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8 #步长为2的卷积 1/8
   [-1, 6, C3, [256]], # 4
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16 #步长为2的卷积 1/16
   [-1, 9, C3, [512]], # 6
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32 #步长为2的卷积 1/32,最高层的特征图尺寸与原图的缩放关系，1/32
   [-1, 3, C3, [1024]], # 8
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]], # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 11
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4 # 12
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]], # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 15
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3 # 16
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)（小目标） # 17

   [-1, 1, Conv, [256, 3, 2]], # 18
   [[-1, 14], 1, Concat, [1]],  # cat head P4 # 19
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)（中目标） # 20

   [-1, 1, Conv, [512, 3, 2]], # 21
   [[-1, 10], 1, Concat, [1]],  # cat head P5 # 22
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)（大目标） # 23

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5) # 24
  ]
